reference/crates.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Pallet Reference - Crates</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2010-06-17 Thu"/>
<meta name="author" content="Hugo Duncan"/>
<meta name="description" content="Pallet reference documentation crates"/>
<meta name="keywords" content="pallet crates configuration"/>
<link rel="stylesheet" type="text/css" href="../doc.css" />
</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<h1 class="title">Pallet Reference - Crates</h1>



<p>
Crates are functions that encapsulate some unit of configuration or
administration. Every crate must take a first argument as a request map, and
must return an updated request map. Crates can take other arguments.
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Composing existing crates </h2>
<div class="outline-text-2" id="text-1">

<p>The simplest way of creating a crate is to compose it from existing crates.
</p>



<pre class="src src-clojure">(<span style="color: #0000ff;">require</span> 'pallet.resource.package)
(<span style="color: #0000ff;">require</span> 'pallet.crate.git)
(<span style="color: #0000ff;">require</span> 'pallet.crate.tomcat)

(<span style="color: #4682b4;">defn</span> <span style="color: #0000ff;">my-simple-config</span>
  [request]
  (<span style="color: #4682b4;">-&gt;</span>
    request
    (pallet.resource.package/package <span style="color: #f4a460;">"maven2"</span>)
    (pallet.crate.git/git)
    (pallet.crate.tomcat/tomcat)))
</pre>



</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Creating resources </h2>
<div class="outline-text-2" id="text-2">

<p><code>defresource</code> can be used to define script producing functions, that can then
be called in crates.
</p>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Aggregate resource </h2>
<div class="outline-text-2" id="text-3">


<p>
<code>defaggregate</code> can be used to define resources that collect arguments over
multiple invocations and emit a resource based on the aggregated arguments.
This is used in the sudoers crate, for example, to emit /etc/sudoers.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Local resources </h2>
<div class="outline-text-2" id="text-4">

<p><code>deflocal</code> defines a resource that will be run on the local machine.
</p>
</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Parameters </h2>
<div class="outline-text-2" id="text-5">

</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Delayed Arguments </h2>
<div class="outline-text-2" id="text-6">

</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Templates </h2>
<div class="outline-text-2" id="text-7">

</div>
</div>
<div id="postamble">
<p class="author"> Author: Hugo Duncan
</p>
<p class="date"> Date: 2010-06-17 Thu</p>
<p class="creator">HTML generated by org-mode 6.36trans in emacs 24</p>
</div>
</div>
</body>
</html>
